Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/social_insurance_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: • Work and social insurance
ga: • Obair agus árachas sóisialach

source: • Social insurance payments and benefits
ga: • Íocaíochtaí agus sochair árachais shóisialaigh

source: Most employers and employees (over 16 years of age and under 66) pay social insurance (PRSI) contributions into the national Social Insurance Fund. In general, the payment of social insurance is compulsory
ga: Íocann an chuid is mó de na fostaitheoirí agus fostaithe (os cionn 16 bliana d’aois agus faoi 66) ranníocaíochtaí árachais shóisialaigh isteach i gCiste Árachais Shóisialta náisiúnta na hÉireann

source: Some people who have unearned income are also liable for PRSI
ga: Go ginearálta, tá íocaíocht an árachais shóisialaigh éigeantach

source: The Social Insurance Fund is made up of a current account and an investment account managed by the Minister for Social Protection and the Minister for Finance, respectively
ga: Tá Ciste Árachais Shóisialaigh na hÉireann déanta suas de chuntas reatha agus de chuntas infheistíochta atá á bhainistiú ag an Aire Coimirce Sóisialaí agus ag an Aire Airgeadais, faoi seach

source: The current account consists of monies collected from people in employment
ga: Is éard atá sa chuntas reatha ná airgead a bailíodh ó dhaoine atá i bhfostaíocht

source: This money is then used to fund social insurance payments
ga: Baintear úsáid as an airgead ansin le híocaíochtaí árachais shóisialaigh a mhaoiniú

source: The investment account is a savings account that is managed by the Minister for Finance
ga: Is cuntas taisce an cuntas infheistíochta atá á bhainistiú ag an Aire Airgeadais

source: The Comptroller and Auditor General is responsible for ensuring that the accounts are kept in order and reports are made to the Houses of the Oireachtas
ga: Tá an Ard-Reachtaire Cuntas agus Ciste freagrach as a chinntiú go gcoinnítear na cuntais in ord agus go ndéantar tuairiscí chuig Tithe an Oireachtais

source: Social insurance contributions are divided into different categories, known as classes or rates of contribution
ga: Chomh maith le híoc isteach sa Chiste Árachais Shóisialaigh, beifear ag dúil go n-íocfaidh tú rud ar a dtugtar an Ranníocaíocht Sláinte, a ghearrtar ar gach ioncam

source: The class and rate of contribution you pay is determined by the nature of your work
ga: Ní íoctar an Ranníocaíocht Sláinte isteach sa Chiste Árachais Shóisialaigh

source: For example, a person employed in a supermarket earning less than €38 per week will be insured under Class J. If that person earned over €38, they would probably be insured under Class A. Most employees pay Class A PRSI
ga: Bailítear an t-airgead seo ó do thuarastal agus íoctar leis an Roinn Sláinte é le seirbhísí sláinte in Éirinn a mhaoiniú

source: Work and social insurance
ga: Obair agus árachas sóisialach

source: If you are in employment, the amount of social insurance you pay depends on your earnings and the type of work you do
ga: Má tá tú i bhfostaíocht, braitheann méid an árachais shóisialaigh a íocann tú ar do thuilleamh agus ar an gcineál oibre a dhéanann tú

source: Your social insurance contributions in Ireland are referred to as PRSI (Pay Related Social Insurance)
ga: Tugtar ÁSPC (Árachas Sóisialach Pá-Choibhneasa) ar do ranníocaíochtaí árachais shóisialaigh in Éirinn

source: Sometimes, you will hear people describe their PRSI contributions as stamps
ga: In amanna, cloisfidh tú daoine ag baint úsáide as an bhfocal stampaí agus iad ag trácht ar a rannaíocaíochtaí ÁSPC

source: This term dated from before 1979 when employers would literally stamp a card each week of employment
ga: Tagann an téarmaí seo ó roimh 1979 nuair a stampáladh fostaitheoirí cárta go fisiceach gach seachtain den fhostaíocht

source: That card was then brought to a social welfare local office when claiming social welfare payments
ga: Tugadh an cárta sin chuig oifig leasa shóisialaigh áitiúil d’fhonn íocaíochtaí leasa shóisialaigh a éileamh

source: If you are an employee, your PRSI contributions are deducted by your employer and collected by Revenue under the PAYE (Pay As You Earn) system
ga: Más fostaí thú, asbhaineann d’fhostaitheoir do ranníocaíochtaí árachais shóisialta agus bailíonn na Coimisinéirí Ioncaim iad

source: In fact, the law makes your employer responsible for PRSI, though you may have to pay an 'employee's share'
ga: De réir an dlí, tá d’fhostaitheoir freagrach as ÁSPC, cé go mb’fhéidir go mbeadh ort ‘sciar fostaí’ a íoc

source: Find out more about 'Paying social insurance'
ga: Léigh níos mó faoi dhualgas d’fhostaitheora árachas sóisialach a íoc anseo

source: If you are self-employed, you pay Class S social insurance contributions directly to the Revenue Commissioners
ga: Má tá tú féinfhostaithe, íocann tú ranníocaíochtaí árachais shóisialaigh Aicme S go díreach leis na Coimisinéirí Ioncaim

source: The Revenue Commissioners then pay the money into the Social Insurance Fund
ga: Ansin íocann na Coimisinéirí Ioncaim an t-airgead isteach sa Chiste Árachais Shóisialaigh

source: Revenue send a record of the contributions you have paid to the Department of Social Protection
ga: Cuireann na Coimisinéirí Ioncaim taifead de na ranníocaíochtaí atá íoctha agat chuig an Roinn Coimirce Sóisialaí

source: You are not liable for PRSI contributions after the age of 66 - this is the case whether or not you are employed or self-employed
ga: Níl dliteanas ranníocaíochtaí ÁSPC ort tar éis aois 66 – tá sé seo amhlaidh is cuma an fostaithe nó féin-fhostaithe atá tú

source: If you do not have enough contributions at age 66, you cannot add to them after that
ga: Muna bhfuil dóthain íocaíochtaí agat ag aois 66, ní féidir leat cur leo ina dhiaidh sin

source: From 2014 unearned income became fully liable for PRSI. Unearned income from rents, investments, dividends and interest on deposits and savings is liable to PRSI at 4% from 1 January 2014
ga: Do dhaoine i bhfostaíocht in Éirinn, roinntear ranníocaíochtaí árachais shóisialaigh i gcatagóirí difriúla, ar a dtugtar aicmí nó rátaí ranníocaíochta

source: People aged under 16 and over 66 are exempt from PRSI and are not liable for the new charge
ga: Cinntear an cineál aicme agus ráta ranníocaíochta a íocann tú de réir nádúr do chuid oibre

source: Anyone with unearned income of over €5,000 (was €3,174) is considered to be a 'chargeable person' and is liable to pay the PRSI charge at 4% on all their unearned income
ga: Mar shampla, beidh duine atá fostaithe in ollmhargadh a thuilleann níos lú ná €38 sa tseachtain árachaithe faoi Aicme J

source: They pay the charge under Revenue's self-assessment system (Pay and File)
ga: Má thuilleann siad níos mó ná €38 sa tseachtain beidh siad árachaithe faoi Aicme A

source: The new PRSI charge is paid at Class K and does not entitle the person to any social insurance benefits
ga: I bhfírinne, íocann an chuid is mó de na fostaithe in Éirinn ÁSPC Aicme A

source: (Generally such income is taxed by reducing a person’s tax credits to account for tax payable
ga: Is iad na haicmí eile árachais ná aicmí C, D, B, E, H, J, S, K, M, agus P

source: However if you have paid Deposit Interest Retention Tax (DIRT) on your non-PAYE income you are not required to pay further income tax on this income.)
ga: Má tá tú árachaithe faoi cheann de na haicmí seo, tá tú ag íoc árachais ag ráta níos ísle ná ranníocóirí aicme A, agus ciallaíonn sé seo nach bhfuil tú i dteideal an réimse iomlán íocaíochtaí árachais shóisialaigh

source: The Department of Social Protection has published Information on the Extension of PRSI liability to unearned income
ga: Tá sé seo de bharr go bhfuil tú ag íoc níos lú árachais shóisialaigh ná ranníocóir aicme A agus P

source: You can also read FAQs on the broadening of the income tax base for PRSI
ga: Beidh méid an ÁSPC a íocann tú ag brath ar do thuillimh agus an aicme a bhfuil tú árachaithe faoi

source: Employing family members and PRSI
ga: Ag coinneáil d’árachas sóisialach

source: If the business does not operate on a sole trader basis - for example if it is a limited company or a partnership - it is not family employment
ga: Tá sé tábhachtach go gcoinníonn tú do thaifead árachais shóisialaigh, chomh fada agus is féidir

source: The following categories of family employment are insurable under the social insurance system in exactly the same way as employments that have no family connection:
ga: Má fhágann tú saol na hoibre, tá sé tábhachtach go gcoinníonn tú do thaifead árachais shóisialaigh gníomhach

source: • If you are employed as an apprentice by a prescribed relative (even if the apprenticeship employment relates to a private dwelling house or a farm in or on which both you and the employer resides) there must be a registered contract of apprenticeship involved (PRSI Class A or Class J applies)
ga: Le do thaifead árachais shóisialaigh a chosaint agus a choinneáil gníomhach, ba cheart duit teagmháil a dhéanamh leis an Roinn Coimirce Sóisialaí lena sheiceáil an féidir leat Ranníocaíochtaí Creidiúnaithe a fháil

source: • If you assist your spouse or civil partner in the running of the family business but are not an employee (PRSI Class S applies)
ga: B’fhéidir go mbeifeá in ann, in imthosca áirithe, Ranníocaíochtaí Deonacha a dhéanamh

source: A prescribed relative is a parent, grandparent, stepparent, son, daughter, grandson, granddaughter, stepson, stepdaughter, brother, sister, half-brother, or half-sister
ga: Chomh maith leis sin, is féidir leat do ranníocaíochtaí Éireannacha agus do rannaíocaíochtaí a d’íoc tú i stáit eile agus tú ag obair thar lear a chur le chéile le bheith incháilithe ar íocaíocht árachais shóisialaigh

source: • •A spouse or civil partner employed by their self-employed spouse or civil partner • If you are employed as an employee by a prescribed relative and the family employment relates to a private dwelling house or a farm in or on which both you and the employer reside
ga: Más oibrí páirtaimseartha thú nó má tá tú i socrú roinnte poist ba cheart duit smaoineamh faoin dóigh ar féidir le do phatrún oibre dul i bhfeidhm ar do thaifead árachais shóisialaigh

source: • If you assist or participate in the running of the family business but not as an employee. (For example, a son/daughter who is attending full-time education who participates in the business after school hours or but is not an employee.)
ga: Tá sé seo thar a bheith ábhartha má tá tú páirtaimseartha nó má tá tú ag roinnt oibre le seachtain shaor mar chuid de do phatrún oibre cionn is gur féidir leat gan íocaíocht ÁSPC a dhéanamh don tseachtain nach bhfuil tú ag obair

source: The €5,000 income threshold applies to these spouses or civil partners in the same way as other self-employed people, so if a spouse or civil partner earns less than this threshold they are not liable to pay PRSI
ga: Léigh anseo le níos mó faisnéise a fháil faoi oibrithe páirtaimseartha agus comhroinnte oibre agus ranníocaíochtaí árachais shóisialaigh

source: If two or more family members (including spouses or civil partners) operate a business as a partnership and share the profits each business partner is insurable as a self-employed contributor (provided they earn over the €5,000 threshold). Read more about family employment
ga: Is í rannóg na dTaifead ÁSPC sa Roinn Coimirce Sóisialaí a choinníonn agus a dhéanann bainistíocht ar gach taifead de do ranníocaíochtaí árachais shóisialaigh

source: Points to note: PRSI Class M is used to record situations in which there is no liability to social insurance
ga: Tá an Roinn freagrach as na h-íocaíochtaí déanta do do ranníocaíochtaí árachais shóisialaigh

source: Subject to certain conditions, if you cease to be covered by compulsory PRSI you may opt to become insured on a voluntary basis and pay voluntary contributions
ga: Is féidir leat teagmháil a dhéanamh chomh maith le Rannóg na dTaifead sa Roinn Coimirce Sóisialaí chun do thaifead ÁSPC a sheiceáil

source: Your entitlement to these benefits depends on a number of conditions as well as the social insurance contribution requirement
ga: D’fhonn do thaifead árachais shóisialaigh a sheiceáil, beidh do Uimhir Phearsanta Seirbhíse Poiblí (PPSN) de dhíth ort

source: The social insurance qualifying criteria vary, depending on what payment you are applying for. In general, when you apply for a social insurance payment the following will be examined:
ga: Is uimhir shainiúil aitheantais í seo atá de dhíth ort le linn duit a bheith ag déileáil le gníomhaireachtaí stáit

source: The social insurance payments available include:
ga: Íocaíochtaí agus sochair árachais shóisialaigh

source: If you leave the workforce, it is important that you keep your social insurance record active
ga: Tá réimse leathan sochar ann atá ar fáil do dhaoine a bhfuil árachas sóisialach íoctha acu

source: To protect your social insurance record and keep it active, you should contact the Department of Social Protection to check if you can get credited contributions
ga: Tá teidlíocht do na sochair seo ag brath ar roinnt coinníollacha seachas an riachtanas maidir le ranníocaíocht árachais shóisialaigh

source: It may be possible in certain circumstances for you to make voluntary contributions
ga: Bíonn na critéir cháilithe difriúil, ag brath ar an íocaíocht a bhfuil tú ag cur iarratais isteach ina leith

source: You can also add Irish contributions and contributions paid in certain other states while working abroad together qualify for a social insurance payment
ga: Go ginearálta, déanfar scrúdú ar na rudaí seo a leanas:

source: If you are a part-time worker or in a job-sharing work arrangement you should be aware of how your pattern of work can affect your social insurance record
ga: • Cén aicme/aicmí árachais shóisialaigh a d’íoc tú

source: This is particularly relevant if you are part-time or job-sharing with a week off as part of your work pattern because you may miss out paying a PRSI contribution for the week you are not working
ga: • An aois nuair a thosaigh tú a dhéanamh ranníocaíochtaí árachais shóisialaigh (tá sé seo i bhfeidhm i gcás na bPinsean Stáit)

source: Find out more about part-time and job-share workers and social insurance contributions
ga: • Cá mhéad ranníocaíochtaí íoctha agus/nó creidiúnaithe atá déanta agat ó chuaigh tú isteach i bhfostaíocht inárachaithe

source: All records of your insurance contributions are kept and managed by the PRSI Records section in the Department of Social Protection
ga: • Líon na ranníocaíochtaí a íocadh agus/nó a creidiúnaíodh sa bhliain chánach ábhartha roimh an bhliain sochair ina ndéanann tú an t-éileamh

source: The Department is responsible for the payments made as a result of your social insurance contributions
ga: Is í an bhliain chánach ábhartha ná an dara bliain dheireanach iomlán cánach sula ndéanann tú éileamh

source: This number is a unique identification number which you need when dealing with state agencies
ga: • Meánmhéid bhliantúil de líon na ranníocaíochtaí i gcás cuid de na pinsin
